base/InformationRegisters/ДействиеСкидокНаценокПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидокНаценокПоНоменклатуре</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействияСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/CommonModules/СкидкиНаценкиВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить адреса схемы компоновки данных во временном хранилище
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, содержит в том числе:
//  	* Объект - ДокументОбъект - Документ
//  Имя - Строка - Имя схемы.
// 
// Возвращаемое значение:
//  Структура - адреса схемы компоновки данных во временном хранилище.
//
Функция ПолучитьАдресаСхемыКомпоновкиДанныхВоВременномХранилище(Форма, Имя) Экспорт
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.СкидкиНаценки") Тогда
		Если Имя = "КомпоновщикНастроекОтборПоНоменклатуре" Тогда
			ИмяМакета = "ОтборСтрокНоменклатура";
		Иначе
			Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
				ИмяМакета = "ОтборСтрокДополнительныеУсловия";
			Иначе
				ИмяМакета = "ОтборСтрокДополнительныеУсловияБезХарактеристик";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.УсловияПредоставленияСкидокНаценок") Тогда
		ИмяМакета = "ОтборУсловияПредоставленияСуммаКоличество";
	КонецЕсли;
	
	Адреса = Новый Структура;
	
	Макет = Справочники.СкидкиНаценки.ПолучитьМакет(ИмяМакета);
	Набор = Макет.НаборыДанных.Найти("НаборДанных");
	ОбеспечениеВДокументахСервер.СкидкиНаценкиПодменитьОстатокНаСкладеПереопределяемый(Набор.Запрос);
	Поля = "ОстатокНаСкладе.Номенклатура,ОстатокНаСкладе.Характеристика,ОстатокНаСкладе.Склад";
	Набор.Запрос = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединение(Набор.Запрос, "ПодстановкаТоварногоОграничения", Поля);
	
	Адреса.Вставить("СхемаКомпоновкиДанных", ПоместитьВоВременноеХранилище(Макет, Форма.УникальныйИдентификатор));
	Адреса.Вставить("НастройкиКомпоновкиДанных",
		ПоместитьВоВременноеХранилище(
			Форма[Имя].ПолучитьНастройки(), Форма.УникальныйИдентификатор));
	
	Возврат Адреса;
	
КонецФункции

// Описание действия внешней обработки
//
// Параметры:
//  ВнешняяОбработка - ВнешняяОбработка - Объект подключенной обработки.
//  АдресНастроекВнешнейОбработки - Строка - Адрес настроек во временном хранилище.
// 
// Возвращаемое значение:
//  Строка - Описание действия внешней обработки.
//
Функция ОписаниеДействияВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки) Экспорт
	
	ВнешнийОбъект = СкидкиНаценкиПовтИсп.ОбъектВнешнейОбработки(ВнешняяОбработка);
	
	Если ЗначениеЗаполнено(АдресНастроекВнешнейОбработки) Тогда
		Параметры = ПолучитьИзВременногоХранилища(АдресНастроекВнешнейОбработки);
	Иначе
		Параметры = Неопределено;
	КонецЕсли;
	
	УстановитьБезопасныйРежим(Истина);
	Описание = ВнешнийОбъект.ОписаниеДействия(Параметры);
	УстановитьБезопасныйРежим(Ложь);
	
	Возврат Описание;
	
КонецФункции

// Автонаименование внешней обработки
//
// Параметры:
//  ВнешняяОбработка - ВнешняяОбработка - Объект подключенной обработки.
//  АдресНастроекВнешнейОбработки - Строка - Адрес настроек во временном хранилище.
// 
// Возвращаемое значение:
//  Строка - Наименование
//
Функция АвтонаименованиеВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки) Экспорт
	
	ВнешнийОбъект = СкидкиНаценкиПовтИсп.ОбъектВнешнейОбработки(ВнешняяОбработка);
	
	Если ЗначениеЗаполнено(АдресНастроекВнешнейОбработки) Тогда
		Параметры = ПолучитьИзВременногоХранилища(АдресНастроекВнешнейОбработки);
	Иначе
		Параметры = Неопределено;
	КонецЕсли;
	
	УстановитьБезопасныйРежим(Истина);
	Автонаименование = ВнешнийОбъект.Автонаименование(Параметры);
	УстановитьБезопасныйРежим(Ложь);
	
	Возврат Автонаименование;
	
КонецФункции

// Имя формы настроек внешней обработки
//
// Параметры:
//  ВнешняяОбработка - ВнешняяОбработка - Объект подключенной обработки.
//  АдресНастроекВнешнейОбработки - Строка - Адрес настроек во временном хранилище.
// 
// Возвращаемое значение:
//  Строка - Имя формы настроек внешней обработки.
//
Функция ИмяФормыНастроекВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки) Экспорт
	
	ИмяОбработки = СкидкиНаценкиПовтИсп.ПодключитьВнешнююОбработку(ВнешняяОбработка);
	ВнешнийОбъект = СкидкиНаценкиПовтИсп.ОбъектВнешнейОбработки(ВнешняяОбработка);
	
	УстановитьБезопасныйРежим(Истина);
	Попытка
		ИмяФормыНастроек = ВнешнийОбъект.ИмяФормыНастроек();
		Если ТипЗнч(ИмяФормыНастроек) <> Тип("Строка") Тогда
			ИмяФормыНастроек = "";
		КонецЕсли;
	Исключение
		ИмяФормыНастроек = "";
	КонецПопытки;
	УстановитьБезопасныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ИмяФормыНастроек) Тогда
		Возврат "ВнешняяОбработка."+ ИмяОбработки +".Форма."+ИмяФормыНастроек;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Описание внешней обработки
//
// Параметры:
//  ВнешняяОбработка - ВнешняяОбработка - Объект подключенной обработки.
//  АдресНастроекВнешнейОбработки - Строка - Адрес настроек во временном хранилище.
// 
// Возвращаемое значение:
//  Структура - Описание внешней обработки.
//
Функция ОписаниеВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ИмяФормыНастроек", ИмяФормыНастроекВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки));
	ВозвращаемоеЗначение.Вставить("Автонаименование", АвтонаименованиеВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки));
	ВозвращаемоеЗначение.Вставить("ОписаниеДействия", ОписаниеДействияВнешнейОбработки(ВнешняяОбработка, АдресНастроекВнешнейОбработки));
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Данные для представления списка товаров
//
// Параметры:
//  Ссылка - СправочникСсылка.СкидкиНаценки - Скидка (наценка).
// 
// Возвращаемое значение:
//  Структура - Данные для представления списка товаров.
//
Функция ДанныеДляПредставленияСпискаТоваров(Ссылка) Экспорт

	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 3
	|	Т.Номенклатура.Представление КАК НоменклатураНаименование,
	|	Т.Характеристика.Представление КАК ХарактеристикаНаименование
	|ИЗ
	|	РегистрСведений.ДействиеСкидокНаценокПоНоменклатуре.СрезПоследних(&ТекущаяДата, Источник = &Источник) КАК Т
	|ГДЕ
	|	Т.Статус = &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК КоличествоПозиций
	|ИЗ
	|	РегистрСведений.ДействиеСкидокНаценокПоНоменклатуре.СрезПоследних(&ТекущаяДата, Источник = &Источник) КАК Т
	|ГДЕ
	|	Т.Статус = &Статус
	|");
	Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Параметры.Вставить("Источник", Ссылка);
	Запрос.Параметры.Вставить("Статус", Перечисления.СтатусыДействияСкидок.Действует);
	
	ПервыеПозиции = Новый Массив;
	
	МассивЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = МассивЗапросов[0]; // РезультатЗапроса
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Наименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				Выборка.НоменклатураНаименование,
				Выборка.ХарактеристикаНаименование);
		ПервыеПозиции.Добавить(Наименование);
	КонецЦикла;
	
	РезультатЗапроса = МассивЗапросов[1]; // РезультатЗапроса
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПервыеПозиции", ПервыеПозиции);
	ВозвращаемоеЗначение.Вставить("ВсегоПозиций", Выборка.КоличествоПозиций);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти
